{
  "hadiths": [
    {
      "id": 1,
      "text": "The believer who mixes with people and bears their annoyance with patience will have a greater reward than the believer who does not mix with people and does not put up with their annoyance.",
      "source": "Sunan Ibn Majah"
    },
    {
      "id": 2,
      "text": "None of you truly believes until he loves for his brother what he loves for himself.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 3,
      "text": "The strong person is not the one who can wrestle someone else down. The strong person is the one who can control himself when he is angry.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 4,
      "text": "Whoever believes in Allah and the Last Day should speak good or keep silent.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 5,
      "text": "The best of people are those who benefit others.",
      "source": "Sunan al-Daraqutni"
    },
    {
      "id": 6,
      "text": "A good word is charity.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 7,
      "text": "Be in this world as if you were a stranger or a traveler along a path.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 8,
      "text": "The world is green and beautiful, and Allah has appointed you as His stewards over it.",
      "source": "Sahih Muslim"
    },
    {
      "id": 9,
      "text": "Whoever removes a worldly grief from a believer, Allah will remove from him one of the griefs of the Day of Judgment.",
      "source": "Sahih Muslim"
    },
    {
      "id": 10,
      "text": "The most beloved deeds to Allah are those that are most consistent, even if they are few.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 11,
      "text": "Whoever is not merciful to others, will not be treated mercifully.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 12,
      "text": "A man is upon the religion of his friend, so let one of you look at whom he befriends.",
      "source": "Sunan Abi Dawud"
    },
    {
      "id": 13,
      "text": "The best jihad is a word of truth spoken before a tyrannical ruler.",
      "source": "Sunan Abi Dawud"
    },
    {
      "id": 14,
      "text": "Actions are but by intention and every man shall have only that which he intended.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 15,
      "text": "The believers in their mutual kindness, compassion, and sympathy are just one body; when a limb suffers, the whole body responds to it with wakefulness and fever.",
      "source": "Sahih Muslim"
    },
    {
      "id": 16,
      "text": "Whoever believes in Allah and the Last Day should honor his guest.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 17,
      "text": "The Muslim is the one from whose tongue and hand the Muslims are safe.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 18,
      "text": "Remember often the destroyer of pleasures: death.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 19,
      "text": "Every act of kindness is charity.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 20,
      "text": "Allah does not look at your forms and possessions, but He looks at your hearts and your deeds.",
      "source": "Sahih Muslim"
    },
    {
      "id": 21,
      "text": "The most perfect of believers in faith are those who are best in character.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 22,
      "text": "Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and the Hereafter.",
      "source": "Sahih Muslim"
    },
    {
      "id": 23,
      "text": "Make things easy and do not make them difficult, cheer the people up by conveying glad tidings to them and do not repulse them.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 24,
      "text": "Verily, Allah is gentle and loves gentleness in all matters.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 25,
      "text": "The Prophet said: 'Religion is very easy and whoever overburdens himself in his religion will not be able to continue in that way.'",
      "source": "Sahih Bukhari"
    },
    {
      "id": 26,
      "text": "Seek knowledge from the cradle to the grave.",
      "source": "Sunan Ibn Majah"
    },
    {
      "id": 27,
      "text": "The best richness is the richness of the soul.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 28,
      "text": "He who sleeps with a full stomach while his neighbor goes hungry is not one of us.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 29,
      "text": "When you see a person who has been given more than you in money and beauty, look to those who have been given less.",
      "source": "Sahih Muslim"
    },
    {
      "id": 30,
      "text": "Allah has written down the very portion of adultery which a man will indulge in. There will be no escape from it.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 31,
      "text": "Paradise lies at the feet of your mother.",
      "source": "Sunan an-Nasa'i"
    },
    {
      "id": 32,
      "text": "Do not waste water even if performing ablution on the bank of a fast-flowing river.",
      "source": "Sunan Ibn Majah"
    },
    {
      "id": 33,
      "text": "The upper hand is better than the lower hand.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 34,
      "text": "Allah will not be merciful to those who are not merciful to people.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 35,
      "text": "The best of companions with Allah is the one who is best to his companions.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 36,
      "text": "No one eats better food than that which he eats out of the work of his hand.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 37,
      "text": "If Allah wants to do good to somebody, He afflicts him with trials.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 38,
      "text": "The parable of the believers in their affection, mercy, and compassion for each other is that of a body. When any limb aches, the whole body reacts to it with sleeplessness and fever.",
      "source": "Sahih Muslim"
    },
    {
      "id": 39,
      "text": "Whoever Allah wishes good for, He gives him understanding of the religion.",
      "source": "Sahih Bukhari"
    },
    {
      "id": 40,
      "text": "The best of houses is the house where an orphan gets love and kindness.",
      "source": "Sunan Ibn Majah"
    },
    {
      "id": 41,
      "text": "All the sons of Adam are sinners, but the best of sinners are those who repent.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 42,
      "text": "Whoever travels a path in search of knowledge, Allah will make easy for him a path to Paradise.",
      "source": "Sahih Muslim"
    },
    {
      "id": 43,
      "text": "The world is a prison for the believer and paradise for the disbeliever.",
      "source": "Sahih Muslim"
    },
    {
      "id": 44,
      "text": "Indeed, after hardship comes ease.",
      "source": "Quran 94:6"
    },
    {
      "id": 45,
      "text": "Whoever shows mercy to people, Allah will show mercy to him.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 46,
      "text": "The believer is not one who eats his fill while his neighbor goes hungry.",
      "source": "Sunan al-Kubra"
    },
    {
      "id": 47,
      "text": "Smiling in the face of your brother is charity.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 48,
      "text": "The best people are those who live longest and excel in their deeds.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 49,
      "text": "Take benefit of five before five: your youth before your old age, your health before your sickness, your wealth before your poverty, your free time before you are occupied, and your life before your death.",
      "source": "Sunan al-Tirmidhi"
    },
    {
      "id": 50,
      "text": "What a wonderful blessing for the believer that all of his affairs are good for him. If something good happens to him, he is grateful, and that is good for him. If something bad happens to him, he bears it with patience, and that is good for him.",
      "source": "Sahih Muslim"
    }
  ]
}